Ran Plan for 2 projects:

1. project: `rds-prod` dir: `terraform/rds` workspace: `default`
1. project: `fileflow-prod` dir: `terraform/fileflow` workspace: `default`
---

### 1. project: `rds-prod` dir: `terraform/rds` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_db_parameter_group.main will be updated in-place
~ resource "aws_db_parameter_group" "main" {
        id           = "prod-shared-mysql-params"
        name         = "prod-shared-mysql-params"
        tags         = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-params"
            "Owner"       = "platform-team@ryuqqq.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
        # (7 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "innodb_buffer_pool_size" -> null
          - value        = "{DBInstanceClassMemory*3/4}" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "innodb_buffer_pool_size"
          + value        = "{DBInstanceClassMemory*3/4}"
        }

        # (6 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p rds-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Frds%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p rds-prod
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. project: `fileflow-prod` dir: `terraform/fileflow` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/65/default/terraform/fileflow/fileflow-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/65/default/terraform/fileflow": exit status 1
data.aws_kms_key.cloudwatch-logs: Reading...
data.aws_kms_key.ecs-secrets: Reading...
data.aws_vpc.main: Reading...
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/fileflow-cluster]
aws_iam_role.ecs-task-execution: Refreshing state... [id=fileflow-ecs-task-execution-role]
data.aws_ssm_parameter.master-password-secret-name: Reading...
data.aws_ssm_parameter.db-instance-id: Reading...
data.aws_kms_key.secrets-manager: Reading...
aws_iam_role.ecs-task: Refreshing state... [id=fileflow-ecs-task-role]
data.aws_kms_key.ecs-secrets: Read complete after 0s [id=6ed5bf61-9e05-4bf0-ab5e-2233f3e57a1a]
data.aws_kms_key.secrets-manager: Read complete after 0s [id=c864126f-d148-41ef-80eb-ed41a8edb2c4]
data.aws_kms_key.cloudwatch-logs: Read complete after 0s [id=46ee44d3-866f-4029-b456-338f482eb1cb]
data.aws_ssm_parameter.db-instance-id: Read complete after 0s [id=/shared/rds/db-instance-id]
data.aws_ssm_parameter.master-password-secret-name: Read complete after 0s [id=/shared/rds/master-password-secret-name]
data.aws_secretsmanager_secret.db-master-password: Reading...
data.aws_db_instance.main: Reading...
aws_cloudwatch_log_group.fileflow: Refreshing state... [id=/aws/ecs/fileflow]
data.aws_secretsmanager_secret.db-master-password: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:prod-shared-mysql-master-password-OvqFrT]
data.aws_secretsmanager_secret_version.db-master-password: Reading...
data.aws_secretsmanager_secret_version.db-master-password: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:prod-shared-mysql-master-password-OvqFrT|AWSCURRENT]
data.aws_db_instance.main: Read complete after 0s [id=prod-shared-mysql]
data.aws_vpc.main: Read complete after 0s [id=vpc-0f162b9e588276e09]
data.aws_subnets.private: Reading...
data.aws_subnets.public: Reading...
aws_security_group.alb: Refreshing state... [id=sg-019ff11a3b86e8693]
aws_lb_target_group.fileflow: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-tg/1c986d8303b8c294]
data.aws_subnets.private: Read complete after 0s [id=ap-northeast-2]
data.aws_subnets.public: Read complete after 0s [id=ap-northeast-2]
aws_security_group.ecs-tasks: Refreshing state... [id=sg-00ea30a5634d9fed3]
aws_security_group_rule.rds-from-ecs: Refreshing state... [id=sgrule-1145087171]
aws_iam_role_policy_attachment.ecs-task-execution: Refreshing state... [id=fileflow-ecs-task-execution-role-20251021135013126200000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role_policy.ecs-task-execution-secrets will be created
  + resource "aws_iam_role_policy" "ecs-task-execution-secrets" {
      + id          = (known after apply)
      + name        = "fileflow-secrets-access"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "fileflow-ecs-task-execution-role"
    }

  # aws_lb.fileflow will be created
  + resource "aws_lb" "fileflow" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "fileflow-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-019ff11a3b86e8693",
        ]
      + subnets                                                      = [
          + "subnet-0bd2fc282b0fb137a",
          + "subnet-0c8c0ad85064b80bb",
        ]
      + tags                                                         = {
          + "Component"   = "application-load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-alb"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                                                     = {
          + "Component"   = "application-load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-alb"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Component"   = "alb-listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-http-listener"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                                                              = {
          + "Component"   = "alb-listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-http-listener"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/fileflow-tg/1c986d8303b8c294"
          + type             = "forward"
        }
    }

  # aws_secretsmanager_secret.fileflow-db will be created
  + resource "aws_secretsmanager_secret" "fileflow-db" {
      + arn                            = (known after apply)
      + description                    = "FileFlow database credentials and connection information"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = "arn:aws:kms:ap-northeast-2:646886795421:key/c864126f-d148-41ef-80eb-ed41a8edb2c4"
      + name                           = "fileflow/database/credentials"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = {
          + "Component"   = "secrets-manager"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "Name"        = "fileflow-db-credentials"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
      + tags_all                       = {
          + "Component"   = "secrets-manager"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "fileflow"
          + "Name"        = "fileflow-db-credentials"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Service"     = "fileflow"
        }
    }

  # aws_secretsmanager_secret_version.fileflow-db will be created
  + resource "aws_secretsmanager_secret_version" "fileflow-db" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_arn                     = (known after apply)
  + alb_dns_name                = (known after apply)
  + alb_zone_id                 = (known after apply)
  + database_secret_arn         = (known after apply)
  + health_check_url            = (known after apply)
  + service_url                 = (known after apply)
╷
│ Error: listing tags for CloudWatch Logs Log Group (arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/fileflow): operation error CloudWatch Logs: ListTagsForResource, https response error StatusCode: 400, RequestID: 9f0c9fdc-294d-4b35-901a-b3772fb78e1f, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/dcec020c3bd54d5d8231f559e45589eb is not authorized to perform: logs:ListTagsForResource on resource: arn:aws:logs:ap-northeast-2:646886795421:log-group:/aws/ecs/fileflow because no identity-based policy allows the logs:ListTagsForResource action
│ 
│   with aws_cloudwatch_log_group.fileflow,
│   on ecs.tf line 28, in resource "aws_cloudwatch_log_group" "fileflow":
│   28: resource "aws_cloudwatch_log_group" "fileflow" {
│ 
╵

```
</details>

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```